# Agenda

1. Recap
2. Address book
3. More with reading from and writing to files
4. Cleaning data with `nan` and interpolating
5. Analysis with data frames
    - Cutting and categorizing
    - Sorting
    - Grouping
    - Concatenating data frames together
    - Join data frames

# Recap

When we use Pandas, we're mainly using two different data structures:

- Series, which is basically a 1D NumPy array with a nice set of wrappers around it.  Each series has a single dtype.  Pandas often guesses correctly, but you can set it just as you did with NumPy arrays.
- Data frame, which is basically a glorified 2D NumPy array.  Each column in a data frame is a separate series, which means that each column has a separate dtype.  

Both a series and a data frame have an *index*, which describes the rows. An index can contain any type of values at all -- integers, strings, dates, or anything else.  Integers and strings are most common.  The values can even repeat.

A data frame, in addition to an index, has a value for "columns," which describes the names of the columns.

We can retrieve from either a series or from a data frame via the index using `.loc`.  Or we can use the numeric position using `.iloc`.

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
df = DataFrame(np.random.randint(0, 1000, [5,6]),
              index=list('vwxyz'),      # rows
              columns=list('abcdef'))   # columns
df

     a    b    c    d    e    f
v  772  582  393  320   11  773
w  400  535  723  139  423  244
x  475  892  999  438  333  382
y  610  323  559  372  365  336
z  770  201   77   18  935  138

In [4]:
# I can retrieve an entire row via .loc and an index

df.loc['x']

a    475
b    892
c    999
d    438
e    333
f    382
Name: x, dtype: int64

In [5]:
df.loc['x', 'd']   # retrieve row x, column d

438

In [6]:
df.loc['x', 'd'] = 12.34
df   # the dtype for d has changed - now it's np.float64

     a    b    c       d    e    f
v  772  582  393  320.00   11  773
w  400  535  723  139.00  423  244
x  475  892  999   12.34  333  382
y  610  323  559  372.00  365  336
z  770  201   77   18.00  935  138

In [7]:
df.dtypes  # show me all dtypes for all columns

a      int64
b      int64
c      int64
d    float64
e      int64
f      int64
dtype: object

In [8]:
# d is now a float64 column
# but what if I retrieve row x?

df.loc['x']   # the dtype of this row is float64, because Pandas needs to find a type that's good for all values

a    475.00
b    892.00
c    999.00
d     12.34
e    333.00
f    382.00
Name: x, dtype: float64

In [10]:
# what if I want to find all of the elements of column b that are even?

df['b']%2

v    0
w    1
x    0
y    1
z    1
Name: b, dtype: int64

In [11]:
df['b']%2 == 0   # the remainder is 0 if the numbers are even

v     True
w    False
x     True
y    False
z    False
Name: b, dtype: bool

In [12]:
# I can apply this boolean series as a mask index on df['b']
# in this way, I can get a new series, containing all of the values of df['b']
# that are even

#        apply this boolean series as a mask
df['b'][df['b']%2 == 0]

v    582
x    892
Name: b, dtype: int64

In [13]:
# what if we apply our mask index not only to df['b'], but to all of df?

# this will show me all of the rows of the data frame
# (all columns) where b is even 
# aka: it'll only show us rows v and x of df
df[df['b']%2 == 0]

     a    b    c       d    e    f
v  772  582  393  320.00   11  773
x  475  892  999   12.34  333  382

In [14]:
# if we use .loc, and don't directly apply [] to df, we 
# can then also specify which columns we want

# that's because df.loc has the syntax of
# df.loc[ROW_SELECTOR, COLUMN_SELECTOR]
# if you don't select columns explicitly, then you get all of them.

df.loc[df['b']%2 == 0]

     a    b    c       d    e    f
v  772  582  393  320.00   11  773
x  475  892  999   12.34  333  382

In [15]:
# this shows all rows of df
# where df['b'] is even
# and only column 'c'

df.loc[df['b']%2 == 0, 'c']

v    393
x    999
Name: c, dtype: int64

In [16]:
# all rows of df
# where df['b'] is even
# and only columns c and e

df.loc[df['b']%2 == 0, ['c', 'e']]

     c    e
v  393   11
x  999  333

In [19]:
# show me all rows of df
# where df['c'] < df['c'].mean()
# and only columns a and d

df.loc[df['c'] < df['c'].mean(), ['a', 'd']]

     a      d
v  772  320.0
z  770   18.0

In [20]:
df.describe()

                a           b          c          d           e          f
count    5.000000    5.000000    5.00000    5.00000    5.000000    5.00000
mean   605.400000  506.600000  550.20000  172.26800  413.400000  374.60000
std    168.866219  265.577296  346.40612  167.48131  332.750357  241.50735
min    400.000000  201.000000   77.00000   12.34000   11.000000  138.00000
25%    475.000000  323.000000  393.00000   18.00000  333.000000  244.00000
50%    610.000000  535.000000  559.00000  139.00000  365.000000  336.00000
75%    770.000000  582.000000  723.00000  320.00000  423.000000  382.00000
max    772.000000  892.000000  999.00000  372.00000  935.000000  773.00000

In [21]:
df.mean()

a    605.400
b    506.600
c    550.200
d    172.268
e    413.400
f    374.600
dtype: float64

In [22]:
df.sum()

a    3027.00
b    2533.00
c    2751.00
d     861.34
e    2067.00
f    1873.00
dtype: float64

In [23]:
df.max()

a    772.0
b    892.0
c    999.0
d    372.0
e    935.0
f    773.0
dtype: float64

In [24]:
df

     a    b    c       d    e    f
v  772  582  393  320.00   11  773
w  400  535  723  139.00  423  244
x  475  892  999   12.34  333  382
y  610  323  559  372.00  365  336
z  770  201   77   18.00  935  138

In [25]:
df['g'] = ['duck', 'duck', 'duck', 'duck', 'goose']

In [26]:
df

     a    b    c       d    e    f      g
v  772  582  393  320.00   11  773   duck
w  400  535  723  139.00  423  244   duck
x  475  892  999   12.34  333  382   duck
y  610  323  559  372.00  365  336   duck
z  770  201   77   18.00  935  138  goose

In [27]:
df.describe()

                a           b          c          d           e          f
count    5.000000    5.000000    5.00000    5.00000    5.000000    5.00000
mean   605.400000  506.600000  550.20000  172.26800  413.400000  374.60000
std    168.866219  265.577296  346.40612  167.48131  332.750357  241.50735
min    400.000000  201.000000   77.00000   12.34000   11.000000  138.00000
25%    475.000000  323.000000  393.00000   18.00000  333.000000  244.00000
50%    610.000000  535.000000  559.00000  139.00000  365.000000  336.00000
75%    770.000000  582.000000  723.00000  320.00000  423.000000  382.00000
max    772.000000  892.000000  999.00000  372.00000  935.000000  773.00000

In [28]:
df['g'].describe()

count        5
unique       2
top       duck
freq         4
Name: g, dtype: object

# Exercise: Address book

1. Create a data frame in which you have a few friends and family members. Every person in the data frame will have the following columns:
    - `firstname`
    - `lastname`
    - `age`
2. Create the data frame with about 7-10 people.
3. What is the average age of people in your address book?
4. Show the first and last names of people whose ages are above average.
5. Show people (name and age) whose first name is shorter than the average for first names.

In [29]:
df = DataFrame([['a', 'b', 10],
                ['c', 'd', 20],
                ['e', 'f', 30]])
df

   0  1   2
0  a  b  10
1  c  d  20
2  e  f  30

In [32]:
df = DataFrame([['Reuven', 'Lerner', 51],
                ['Atara', 'Lerner-Friedman', 21],
                ['Shikma', 'Lerner-Friedman', 19],
                ['Amotz', 'Lerner-Friedman', 16],
                ['John', 'Smith', 35],
                ['David', 'Cohen', 60],
                ['Sarah', 'Friedman', 59]                
               ],
              columns='firstname lastname age'.split())     # ['firstname', 'lastname', 'age']

In [33]:
df

  firstname         lastname  age
0    Reuven           Lerner   51
1     Atara  Lerner-Friedman   21
2    Shikma  Lerner-Friedman   19
3     Amotz  Lerner-Friedman   16
4      John            Smith   35
5     David            Cohen   60
6     Sarah         Friedman   59

In [35]:
# what's the average age of people in my address book?

df['age'].mean()

37.285714285714285

In [36]:
# what are the names of people whose ages are above average

df['age'] > df['age'].mean()   # this returns a boolean series

0     True
1    False
2    False
3    False
4    False
5     True
6     True
Name: age, dtype: bool

In [37]:
#        row selectors via a mask/boolean index
df.loc[df['age'] > df['age'].mean()]

  firstname  lastname  age
0    Reuven    Lerner   51
5     David     Cohen   60
6     Sarah  Friedman   59

In [38]:
#       row selector                    ,  column selector
df.loc[df['age'] > df['age'].mean(),      ['firstname', 'lastname']  ]

  firstname  lastname
0    Reuven    Lerner
5     David     Cohen
6     Sarah  Friedman

In [41]:
# find all people
# whose first name is shorter than the average first name

df['firstname'].str.len().mean()

5.142857142857143

In [42]:
df['firstname'].str.len() < df['firstname'].str.len().mean()

0    False
1     True
2    False
3     True
4     True
5     True
6     True
Name: firstname, dtype: bool

In [44]:
# find all rows
# where the first name is shorter than the average first name
# all columns (so we don't need a column selector)

df.loc[df['firstname'].str.len() < df['firstname'].str.len().mean()]

  firstname         lastname  age
1     Atara  Lerner-Friedman   21
3     Amotz  Lerner-Friedman   16
4      John            Smith   35
5     David            Cohen   60
6     Sarah         Friedman   59

In [45]:
# earlier, I created the data frame as a list of lists

df = DataFrame([['Reuven', 'Lerner', 51],
                ['Atara', 'Lerner-Friedman', 21],
                ['Shikma', 'Lerner-Friedman', 19],
                ['Amotz', 'Lerner-Friedman', 16],
                ['John', 'Smith', 35],
                ['David', 'Cohen', 60],
                ['Sarah', 'Friedman', 59]                
               ],
              columns='firstname lastname age'.split())     # ['firstname', 'lastname', 'age']

In [46]:
# I can also create this data frame as a list of dicts
# each dictionary represents one row
# the keys are the column names, and the values are .. the values

# we don't need to specify column names


df = DataFrame([{'firstname':'Reuven', 'lastname':'Lerner', 'age':51},
               {'firstname':'Atara', 'lastname':'Lerner-Friedman', 'age':21},
               {'firstname':'Shikma', 'lastname':'Lerner-Friedman', 'age':19},
               {'firstname':'Amotz', 'lastname':'Lerner-Friedman', 'age':16}
               ])

In [47]:
df

  firstname         lastname  age
0    Reuven           Lerner   51
1     Atara  Lerner-Friedman   21
2    Shikma  Lerner-Friedman   19
3     Amotz  Lerner-Friedman   16

# Reading from and writing to files

Yesterday, we saw that we can read from CSV, Excel, and feather files.  We can write to them, as well.

We saw a few of the parameters we can specify when reading from a CSV file:
- `sep`, the separator, defaulting to `,`
- `usecols`, a list of column names that we want to include in our data frame

In [49]:
!head airlines.dat

1,"Private flight",\N,"-","N/A","","","Y"
2,"135 Airways",\N,"","GNL","GENERAL","United States","N"
3,"1Time Airline",\N,"1T","RNX","NEXTIME","South Africa","Y"
4,"2 Sqn No 1 Elementary Flying Training School",\N,"","WYT","","United Kingdom","N"
5,"213 Flight Unit",\N,"","TFU","","Russia","N"
6,"223 Flight Unit State Airline",\N,"","CHD","CHKALOVSK-AVIA","Russia","N"
7,"224th Flight Unit",\N,"","TTF","CARGO UNIT","Russia","N"
8,"247 Jet Ltd",\N,"","TWF","CLOUD RUNNER","United Kingdom","N"
9,"3D Aviation",\N,"","SEC","SECUREX","United States","N"
10,"40-Mile Air",\N,"Q5","MLA","MILE-AIR","United States","Y"

In [50]:
# read in data about every airline in the world
df = pd.read_csv('airlines.dat')

In [51]:
df.head()

,1,Private flight,\N,-,N/A,Unnamed: 5,Unnamed: 6,Y
0,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
1,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
2,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N
3,5,213 Flight Unit,\N,NaN,TFU,NaN,Russia,N
4,6,223 Flight Unit State Airline,\N,NaN,CHD,CHKALOVSK-AVIA,Russia,N

In [69]:
# if the CSV file doesn't start with column names, we need to:
# (1) tell it not to use the first row as columns, so we don't lose data
# (2) name the columns ourselves

df = pd.read_csv('airlines.dat', 
                header=None,   # the first row of the file is *not* a header row
                names=['id', 'fullname', 'junk', '2code', '3code', 'formal name', 'country', 'morejunk'],
                usecols=['id', 'fullname', '2code', '3code', 'formal name', 'country'])

In [70]:
df.head()

,id,fullname,2code,3code,formal name,country
0,1,Private flight,-,NaN,NaN,NaN
1,2,135 Airways,NaN,GNL,GENERAL,United States
2,3,1Time Airline,1T,RNX,NEXTIME,South Africa
3,4,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,NaN,United Kingdom
4,5,213 Flight Unit,NaN,TFU,NaN,Russia

In [66]:
'abc', 'def'

('abc', 'def')

In [67]:
'abc' 'def'

'abcdef'

In [71]:
# I'd like the "id" column to be the index of my data frame

df = df.set_index('id')   # set_index returns a new data frame, in which the "id" column is the index

In [72]:
df

,fullname,2code,3code,formal name,country
id,,,,,
1,Private flight,-,NaN,NaN,NaN
2,135 Airways,NaN,GNL,GENERAL,United States
3,1Time Airline,1T,RNX,NEXTIME,South Africa
4,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,NaN,United Kingdom
5,213 Flight Unit,NaN,TFU,NaN,Russia
...,...,...,...,...,...
19828,Vuela Cuba,6C,6CC,NaN,Cuba
19830,All Australia,88,8K8,NaN,Australia
19831,Fly Europa,ER,RWW,NaN,Spain
19834,FlyPortugal,PO,FPT,FlyPortugal,Portugal
19845,FTI Fluggesellschaft,NaN,FTI,NaN,Germany

In [73]:
df = df.reset_index()   # return a new data frame without an index, and then assign it to df

In [74]:
df

,id,fullname,2code,3code,formal name,country
0,1,Private flight,-,NaN,NaN,NaN
1,2,135 Airways,NaN,GNL,GENERAL,United States
2,3,1Time Airline,1T,RNX,NEXTIME,South Africa
3,4,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,NaN,United Kingdom
4,5,213 Flight Unit,NaN,TFU,NaN,Russia
...,...,...,...,...,...,...
6043,19828,Vuela Cuba,6C,6CC,NaN,Cuba
6044,19830,All Australia,88,8K8,NaN,Australia
6045,19831,Fly Europa,ER,RWW,NaN,Spain
6046,19834,FlyPortugal,PO,FPT,FlyPortugal,Portugal
6047,19845,FTI Fluggesellschaft,NaN,FTI,NaN,Germany

In [75]:
df = pd.read_csv('airlines.dat', 
                header=None,   # the first row of the file is *not* a header row
                names=['id', 'fullname', 'junk', '2code', '3code', 'formal name', 'country', 'morejunk'],
                usecols=['id', 'fullname', '2code', '3code', 'formal name', 'country'],
                index_col='id')
df

,fullname,2code,3code,formal name,country
id,,,,,
1,Private flight,-,NaN,NaN,NaN
2,135 Airways,NaN,GNL,GENERAL,United States
3,1Time Airline,1T,RNX,NEXTIME,South Africa
4,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,NaN,United Kingdom
5,213 Flight Unit,NaN,TFU,NaN,Russia
...,...,...,...,...,...
19828,Vuela Cuba,6C,6CC,NaN,Cuba
19830,All Australia,88,8K8,NaN,Australia
19831,Fly Europa,ER,RWW,NaN,Spain
19834,FlyPortugal,PO,FPT,FlyPortugal,Portugal
19845,FTI Fluggesellschaft,NaN,FTI,NaN,Germany

In [76]:
df = DataFrame([['Reuven', 'Lerner', 51],
                ['Atara', 'Lerner-Friedman', 21],
                ['Shikma', 'Lerner-Friedman', 19],
                ['Amotz', 'Lerner-Friedman', 16],
                ['John', 'Smith', 35],
                ['David', 'Cohen', 60],
                ['Sarah', 'Friedman', 59]                
               ],
              columns='פרטי משפחה גיל'.split())     # ['firstname', 'lastname', 'age']

In [77]:
df.head()

     פרטי            משפחה  גיל
0  Reuven           Lerner   51
1   Atara  Lerner-Friedman   21
2  Shikma  Lerner-Friedman   19
3   Amotz  Lerner-Friedman   16
4    John            Smith   35

In [78]:
df.to_csv('family.csv')

In [79]:
!cat family.csv

,פרטי,משפחה,גיל
0,Reuven,Lerner,51
1,Atara,Lerner-Friedman,21
2,Shikma,Lerner-Friedman,19
3,Amotz,Lerner-Friedman,16
4,John,Smith,35
5,David,Cohen,60
6,Sarah,Friedman,59

In [80]:
df = pd.read_csv('family.csv')

In [81]:
df

   Unnamed: 0    פרטי            משפחה  גיל
0           0  Reuven           Lerner   51
1           1   Atara  Lerner-Friedman   21
2           2  Shikma  Lerner-Friedman   19
3           3   Amotz  Lerner-Friedman   16
4           4    John            Smith   35
5           5   David            Cohen   60
6           6   Sarah         Friedman   59

In [82]:
df.drop('Unnamed: 0', axis='columns')

     פרטי            משפחה  גיל
0  Reuven           Lerner   51
1   Atara  Lerner-Friedman   21
2  Shikma  Lerner-Friedman   19
3   Amotz  Lerner-Friedman   16
4    John            Smith   35
5   David            Cohen   60
6   Sarah         Friedman   59

In [83]:
df.גיל

0    51
1    21
2    19
3    16
4    35
5    60
6    59
Name: גיל, dtype: int64

In [84]:
df.to_json('family.json')

In [85]:
!cat family.json

{"Unnamed: 0":{"0":0,"1":1,"2":2,"3":3,"4":4,"5":5,"6":6},"\u05e4\u05e8\u05d8\u05d9":{"0":"Reuven","1":"Atara","2":"Shikma","3":"Amotz","4":"John","5":"David","6":"Sarah"},"\u05de\u05e9\u05e4\u05d7\u05d4":{"0":"Lerner","1":"Lerner-Friedman","2":"Lerner-Friedman","3":"Lerner-Friedman","4":"Smith","5":"Cohen","6":"Friedman"},"\u05d2\u05d9\u05dc":{"0":51,"1":21,"2":19,"3":16,"4":35,"5":60,"6":59}}

In [86]:
df = pd.read_json('family.json')

In [87]:
df

   Unnamed: 0    פרטי            משפחה  גיל
0           0  Reuven           Lerner   51
1           1   Atara  Lerner-Friedman   21
2           2  Shikma  Lerner-Friedman   19
3           3   Amotz  Lerner-Friedman   16
4           4    John            Smith   35
5           5   David            Cohen   60
6           6   Sarah         Friedman   59

In [88]:
help(pd.read_json)

Help on function read_json in module pandas.io.json._json:

read_json(path_or_buf=None, orient=None, typ='frame', dtype: 'DtypeArg | None' = None, convert_axes=None, convert_dates=True, keep_default_dates: 'bool' = True, numpy: 'bool' = False, precise_float: 'bool' = False, date_unit=None, encoding=None, encoding_errors: 'str | None' = 'strict', lines: 'bool' = False, chunksize: 'int | None' = None, compression: 'CompressionOptions' = 'infer', nrows: 'int | None' = None, storage_options: 'StorageOptions' = None)
    Convert a JSON string to pandas object.

    Parameters
    ----------
    path_or_buf : a valid JSON str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, and file. For file URLs, a host is
        expected. A local file could be:
        ``file://localhost/path/to/table.json``.

        If you want to pass in a path object, pandas accepts any
        ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method,
        such as a file handle (e.g. via builtin ``open`` function)
        or ``StringIO``.
    orient : str
        Indication of expected JSON string format.
        Compatible JSON strings can be produced by ``to_json()`` with a
        corresponding orient value.
        The set of possible orients is:

        - ``'split'`` : dict like
          ``{index -> [index], columns -> [columns], data -> [values]}``
        - ``'records'`` : list like
          ``[{column -> value}, ... , {column -> value}]``
        - ``'index'`` : dict like ``{index -> {column -> value}}``
        - ``'columns'`` : dict like ``{column -> {index -> value}}``
        - ``'values'`` : just the values array

        The allowed and default values depend on the value
        of the `typ` parameter.

        * when ``typ == 'series'``,

          - allowed orients are ``{'split','records','index'}``
          - default is ``'index'``
          - The Series index must be unique for orient ``'index'``.

        * when ``typ == 'frame'``,

          - allowed orients are ``{'split','records','index',
            'columns','values', 'table'}``
          - default is ``'columns'``
          - The DataFrame index must be unique for orients ``'index'`` and
            ``'columns'``.
          - The DataFrame columns must be unique for orients ``'index'``,
            ``'columns'``, and ``'records'``.

    typ : {'frame', 'series'}, default 'frame'
        The type of object to recover.

    dtype : bool or dict, default None
        If True, infer dtypes; if a dict of column to dtype, then use those;
        if False, then don't infer dtypes at all, applies only to the data.

        For all ``orient`` values except ``'table'``, default is True.

        .. versionchanged:: 0.25.0

           Not applicable for ``orient='table'``.

    convert_axes : bool, default None
        Try to convert the axes to the proper dtypes.

        For all ``orient`` values except ``'table'``, default is True.

        .. versionchanged:: 0.25.0

           Not applicable for ``orient='table'``.

    convert_dates : bool or list of str, default True
        If True then default datelike columns may be converted (depending on
        keep_default_dates).
        If False, no dates will be converted.
        If a list of column names, then those columns will be converted and
        default datelike columns may also be converted (depending on
        keep_default_dates).

    keep_default_dates : bool, default True
        If parsing dates (convert_dates is not False), then try to parse the
        default datelike columns.
        A column label is datelike if

        * it ends with ``'_at'``,

        * it ends with ``'_time'``,

        * it begins with ``'timestamp'``,

        * it is ``'modified'``, or

        * it is ``'date'``.

    numpy : bool, default False
        Direct decoding to numpy arrays. Supports numeric data only, but
        non-numeric column and index labels are supported. Note also that the
        JSON ordering MUST be the same for each term if numpy=True.

        .. deprecated:: 1.0.0

    precise_float : bool, default False
        Set to enable usage of higher precision (strtod) function when
        decoding string to double values. Default (False) is to use fast but
        less precise builtin functionality.

    date_unit : str, default None
        The timestamp unit to detect if converting dates. The default behaviour
        is to try and detect the correct precision, but if this is not desired
        then pass one of 's', 'ms', 'us' or 'ns' to force parsing only seconds,
        milliseconds, microseconds or nanoseconds respectively.

    encoding : str, default is 'utf-8'
        The encoding to use to decode py3 bytes.

    encoding_errors : str, optional, default "strict"
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

        .. versionadded:: 1.3.0

    lines : bool, default False
        Read the file as a json object per line.

    chunksize : int, optional
        Return JsonReader object for iteration.
        See the `line-delimited json docs
        <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#line-delimited-json>`_
        for more information on ``chunksize``.
        This can only be passed if `lines=True`.
        If this is None, the file will be read into memory all at once.

        .. versionchanged:: 1.2

           ``JsonReader`` is a context manager.

    compression : str or dict, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and 'path_or_buf' is
        path-like, then detect compression from the following extensions: '.gz',
        '.bz2', '.zip', '.xz', or '.zst' (otherwise no compression). If using
        'zip', the ZIP file must contain only one data file to be read in. Set to
        ``None`` for no decompression. Can also be a dict with key ``'method'`` set
        to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``} and other
        key-value pairs are forwarded to ``zipfile.ZipFile``, ``gzip.GzipFile``,
        ``bz2.BZ2File``, or ``zstandard.ZstdDecompressor``, respectively. As an
        example, the following could be passed for Zstandard decompression using a
        custom compression dictionary:
        ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

        .. versionchanged:: 1.4.0 Zstandard support.

    nrows : int, optional
        The number of lines from the line-delimited jsonfile that has to be read.
        This can only be passed if `lines=True`.
        If this is None, all the rows will be returned.

        .. versionadded:: 1.1

    storage_options : dict, optional
        Extra options that make sense for a particular storage connection, e.g.
        host, port, username, password, etc. For HTTP(S) URLs the key-value pairs
        are forwarded to ``urllib`` as header options. For other URLs (e.g.
        starting with "s3://", and "gcs://") the key-value pairs are forwarded to
        ``fsspec``. Please see ``fsspec`` and ``urllib`` for more details.

        .. versionadded:: 1.2.0

    Returns
    -------
    Series or DataFrame
        The type returned depends on the value of `typ`.

    See Also
    --------
    DataFrame.to_json : Convert a DataFrame to a JSON string.
    Series.to_json : Convert a Series to a JSON string.
    json_normalize : Normalize semi-structured JSON data into a flat table.

    Notes
    -----
    Specific to ``orient='table'``, if a :class:`DataFrame` with a literal
    :class:`Index` name of `index` gets written with :func:`to_json`, the
    subsequent read operation will incorrectly set the :class:`Index` name to
    ``None``. This is because `index` is also used by :func:`DataFrame.to_json`
    to denote a missing :class:`Index` name, and the subsequent
    :func:`read_json` operation cannot distinguish between the two. The same
    limitation is encountered with a :class:`MultiIndex` and any names
    beginning with ``'level_'``.

    Examples
    --------
    >>> df = pd.DataFrame([['a', 'b'], ['c', 'd']],
    ...                   index=['row 1', 'row 2'],
    ...                   columns=['col 1', 'col 2'])

    Encoding/decoding a Dataframe using ``'split'`` formatted JSON:

    >>> df.to_json(orient='split')
        '{"columns":["col 1","col 2"],"index":["row 1","row 2"],"data":[["a","b"],["c","d"]]}'
    >>> pd.read_json(_, orient='split')
          col 1 col 2
    row 1     a     b
    row 2     c     d

    Encoding/decoding a Dataframe using ``'index'`` formatted JSON:

    >>> df.to_json(orient='index')
    '{"row 1":{"col 1":"a","col 2":"b"},"row 2":{"col 1":"c","col 2":"d"}}'

    >>> pd.read_json(_, orient='index')
          col 1 col 2
    row 1     a     b
    row 2     c     d

    Encoding/decoding a Dataframe using ``'records'`` formatted JSON.
    Note that index labels are not preserved with this encoding.

    >>> df.to_json(orient='records')
    '[{"col 1":"a","col 2":"b"},{"col 1":"c","col 2":"d"}]'
    >>> pd.read_json(_, orient='records')
      col 1 col 2
    0     a     b
    1     c     d

    Encoding with Table Schema

    >>> df.to_json(orient='table')
        '{"schema":{"fields":[{"name":"index","type":"string"},{"name":"col 1","type":"string"},{"name":"col 2","type":"string"}],"primaryKey":["index"],"pandas_version":"1.4.0"},"data":[{"index":"row 1","col 1":"a","col 2":"b"},{"index":"row 2","col 1":"c","col 2":"d"}]}'

# Exercise: Big cities

1. Read `cities.json` into a data frame. (I'll give you the URL for this file, containing the 1,000 largest cities in the United States.)

Don't forget that `pd.read_csv` and `pd.read_json` take URLs, not just filenames, as a first argument.

2. What are the mean and median populations for these cities?
4. What if we remove the 50 most populous cities from these calculations? Does the mean change?  Does the median change?  (You can get this by looking for a rank of >=50.)
5. What is the northernmost city in this data set?
6. Which state has the most cities in this list? Which has the fewest?

In [89]:
url = 'https://gist.githubusercontent.com/reuven/77edbb0292901f35019f17edb9794358/raw/2bf258763cdddd704f8ffd3ea9a3e81d25e2c6f6/cities.json'

df = pd.read_json(url)

In [90]:
df.head()

,city,growth_from_2000_to_2013,latitude,longitude,population,rank,state
0,New York,4.8%,40.712784,-74.005941,8405837,1,New York
1,Los Angeles,4.8%,34.052234,-118.243685,3884307,2,California
2,Chicago,-6.1%,41.878114,-87.629798,2718782,3,Illinois
3,Houston,11.0%,29.760427,-95.369803,2195914,4,Texas
4,Philadelphia,2.6%,39.952584,-75.165222,1553165,5,Pennsylvania

In [91]:
# what are the mean and median populations for these cities?

df['population'].mean()

131132.443

In [92]:
df['population'].median()

68207.0

In [93]:
df['population'].quantile(0.5)

68207.0

In [94]:
df['population'].describe()

count    1.000000e+03
mean     1.311324e+05
std      3.416902e+05
min      3.687700e+04
25%      4.969775e+04
50%      6.820700e+04
75%      1.098850e+05
max      8.405837e+06
Name: population, dtype: float64

In [98]:
df['population'].agg(['mean', 'median'])

mean      131132.443
median     68207.000
Name: population, dtype: float64

In [100]:
# remove the 50 most populous cities.  Do the mean and median change?
#       roe 
df.loc[df['rank'] > 50]

,city,growth_from_2000_to_2013,latitude,longitude,population,rank,state
50,New Orleans,-21.6%,29.951066,-90.071532,378715,51,Louisiana
51,Bakersfield,48.4%,35.373292,-119.018713,363630,52,California
52,Tampa,16.0%,27.950575,-82.457178,352957,53,Florida
53,Honolulu,-6.2%,21.306944,-157.858333,347884,54,Hawaii
54,Aurora,24.4%,39.729432,-104.831919,345803,55,Colorado
...,...,...,...,...,...,...,...
995,Weslaco,28.8%,26.159519,-97.990837,37093,996,Texas
996,Keizer,14.4%,44.990119,-123.026208,37064,997,Oregon
997,Spanish Fork,78.1%,40.114955,-111.654923,36956,998,Utah
998,Beloit,2.9%,42.508348,-89.031776,36888,999,Wisconsin
999,Panama City,0.1%,30.158813,-85.660206,36877,1000,Florida